In [1]:
import dask.dataframe as dd

In [2]:
ddf = dd.read_parquet("../data/mrpowers-h2o/groupby-1e7/parquet")

In [3]:
len(ddf)

10000000

In [4]:
ddf.head()

     id1    id2           id3  id4  id5   id6  v1  v2         v3
0  id001  id001  id0000010277   34   48  4336   4   8  51.935818
1  id001  id001  id0000010179   68   88  6075   1   4  61.951861
2  id001  id001  id0000077289   14   22  4124   1   3  57.146678
3  id001  id001  id0000018937   63   60  1475   4   7  26.972782
4  id001  id001  id0000015670   26   95  4599   3   3  11.137509

In [11]:
ddf.dtypes

id1     object
id2     object
id3     object
id4      int64
id5      int64
id6      int64
v1       int64
v2       int64
v3     float64
dtype: object

## q1: filter, then aggregate

In [15]:
ddf.loc[ddf["id2"] == "id089"].groupby("id1").id4.sum().compute()

id1
id001    51502
id002    51241
id003    50957
id004    48997
id005    51127
         ...
id096    50344
id097    50422
id098    50498
id099    51170
id100    50065
Name: id4, Length: 100, dtype: int64

## q2: aggregate, then filter

In [21]:
t = ddf.groupby("id3").agg({"id4": "sum", "v2": "mean"})
t.loc[(t["id4"] > 50) & (t["v2"] > 5.0)].compute()

              id4    v2
id3
id0000000112   63   9.0
id0000000192  142   7.0
id0000000198   89  14.0
id0000000213   51  14.0
id0000000250   99   6.0
...           ...   ...
id0000002235   69  11.0
id0000002668   67   7.0
id0000003285   76  14.0
id0000004410   76  14.0
id0000005937  100   8.0

[97595 rows x 2 columns]